/****************************************************************************
*
* File Name   : manual_action_si_base.c
*
* Description :
*
*
* Revision History	:
*
* Date			Modification				Name
* -----------	-------------------------------------	------------------
*
****************************************************************************/


/* ======================================================================== */
/* Include. 																*/
/* ======================================================================== */
/** @brief global header file  */
#include <octo_common.h>

#include <db_param.h>

#include <svc_pipe.h>
#include <svc_resources.h>

#include <bus.h>

#include <mgr_common.h>
#include <mgr_action.h>

#include "../local_include/_xmgr_action.h"


/* ======================================================================== */
/* Private Macros. 															*/
/* ======================================================================== */

/* ======================================================================== */
/* Global/Extern Variables.													*/
/* ======================================================================== */

/* ======================================================================== */
/* Private Types.															*/
/* ======================================================================== */


/* ======================================================================== */
/* Private Constants. 														*/
/* ======================================================================== */

/* ======================================================================== */
/* Private Variables. 														*/
/* ======================================================================== */

/* ======================================================================== */
/* Private Function prototypes. 											*/
/* ======================================================================== */

/* ======================================================================== */
/* Functions. 																*/
/* ======================================================================== */

#define	_______GLOBAL_API_______

HERROR xmgr_action_SiGetDefaultTimeout_Mostelecom(SiTableType_e eTableType, HUINT32 *pulTimeout)
{
	switch(eTableType)
	{
	case eSI_TableType_PMT:			*pulTimeout = 1000;			return ERR_OK;
	case eSI_TableType_SDT_ACT:		*pulTimeout = 5000;			return ERR_OK; // SDT oth 가 5 초안에 들어 오니 한번만 더 기다려 보자.
	case eSI_TableType_SDT_OTH:		*pulTimeout = 5000;			return ERR_OK;
	case eSI_TableType_EIT_ACTPF:	*pulTimeout = 4000;			return ERR_OK;
	default:
		/* timeout is not determined */
		return ERR_FAIL;
	}
}

