/**
	@file	  port_itk_crypto.h													\n
	@brief	  itk crypto header file for CRYPTO porting layer						\n

	Description: ITK에서 Crypto Porting 에 사용되는 기능을 정의한 header 파일  	\n
	Module: mheg	/itk								 						\n

	Copyright (c) 2008 HUMAX Co., Ltd.											\n
	All rights reserved.														\n
*/


#ifndef _PORT_ITK_CRYPTO_H
#define _PORT_ITK_CRYPTO_H

/*******************************************************************/
/********************      Header Files    *************************/
/*******************************************************************/
#include "itk_crypto.h"

/*******************************************************************/
/********************      Global Variables     ********************/
/*******************************************************************/



/*******************************************************************/
/********************      Macro Definition     ********************/
/*******************************************************************/



/*******************************************************************/
/********************      Typedef         *************************/
/*******************************************************************/



/*******************************************************************/
/********************      Public Functions     ********************/
/*******************************************************************/


void	PORT_ITK_Crypto_CreateObject(redkey_profile_t eItkProfile);

#ifdef CONFIG_DEBUG
void PORT_ITK_Crypto_Debug_ShowSha1Status(void);
#endif

#endif 	/* end of _PORT_ITK_CRYPTO_H */



