/**
@file     file_name.c File Name을 적습니다.
@brief    file_name & simple comment.

Description: File에 대한 설명을 적습니다.		\n
Module: Layer와 모듈 명을 적습니다.			 	\n
Remarks : 										\n

Copyright (c) 2008 HUMAX Co., Ltd.				\n
All rights reserved.							\n
*/

/*******************************************************************/
/********************      Header Files    *************************/
/*******************************************************************/
#include <stdlib.h>
#include <octo_common.h>

#include "linkedlist.h"

#include <db_param.h>
#include <db_svc.h>
#include "isosvc.h"
#include <svc_epg.h>
#include <util.h>

#include "../local_include/_xsvc_epg.h"

/*******************************************************************/
/********************      Global Variables     ********************/
/*******************************************************************/


/*******************************************************************/
/********************      Defines         *************************/
/*******************************************************************/

/*******************************************************************/
/********************      Typedef         *************************/
/*******************************************************************/

/*******************************************************************/
/********************      Static Variables     ********************/
/*******************************************************************/

/*******************************************************************/
/********************      Functions       *************************/
/*******************************************************************/

HERROR	xsvc_epgdb_GetEpgTypeByTableId_Base(HUINT8 ucTableId, SvcEpg_Type_b *pbwEpgType)
{

	if (ucTableId == 0x4E || ucTableId == 0x4F)
		*pbwEpgType = eOxEPG_TYPE_PF;
	else if (0x50 <= ucTableId && ucTableId <= 0x6F)
		*pbwEpgType = eOxEPG_TYPE_SC;
	else
		*pbwEpgType = eOxEPG_TYPE_NONE;

	return ERR_OK;
}

/*********************** End of File *******************************/
