/*
 * (c) 2011-2012 Humax Co., Ltd. 
 * This program is produced by Humax Co., Ltd. ("Humax") and 
 * the proprietary Software of Humax and its licensors. Humax provides you, as an Authorized Licensee, 
 * non-assignable, non-transferable and non-exclusive license to use this Software. 
 * You acknowledge that this Software contains valuable trade secrets of Humax and by using this Software 
 * you agree to the responsibility to take all reasonable efforts to protect the any information 
 * you receive from Humax. You are not permitted to duplicate, modify, distribute, sell or lease and 
 * reverse engineer or extract the source code of this Software unless you have Humax's written permission to do so.
 * If you have no authorized license, discontinue using this Software immediately. 
 * 
 * THE SOFTWARE IS PROVIDED "AS IS" AND HUMAX MAKES NO PROMISES, REPRESENTATIONS OR WARRANTIES, EITHER EXPRESS, 
 * IMPLIED OR STATUTORY, OR OTHERWISE, WITH RESPECT TO THE SOFTWARE. 
 * IN NO EVENT SHALL HUMAX BE LIABLE FOR LOST PROFITS, REVENUES, OR DATA, FINANCIAL LOSSES OR INDIRECT, SPECIAL,
 * CONSEQUENTIAL, EXEMPLARTY OR PUNITIVE DAMAGES WHATSOEVER RELATING TO YOUR USE OR INABILITY TO USE THE SOFTWARE.

 * This License is effective until terminated. You may terminate this License at any time by destroying all copies 
 * of the Software including all documentation. This License will terminate immediately without notice from Humax 
 * to you if you fail to comply with any provision of this License. Upon termination, you must destroy all copies 
 * of the Software and all documentation.  

 * The laws of the Republic of Korea will apply to any disputes arising out of or relating to this Copyright Notice. 
 * All claims arising out of or relating to this Copyright Notice will be litigated in the Seoul Central District Court, 
 * in the Republic of Korea.
*/
/*
	fword.c
	Copyright(c) 1996-2005 ACCESS CO., LTD.
	All rights are reserved by ACCESS CO., LTD., whether the whole or
	part of the source code including any modifications.
*/


#include		"pword.h"

/* 付加される語の文字列コード表 */
unsigned char	pluswd[] = {
		0x00,	0x01,	0x02,	0xC3,	0x02,	0xE9,	0x02,	0xEA,
		0x02,	0xEB,	0x02,	0xEC,	0x02,	0xED,	0x02,	0xAB,
		0x02,	0xAD,	0x02,	0xAF,	0x02,	0xB1,	0x02,	0xB3,
		0x02,	0xC3,	0x02,	0xE8,	0x02,	0xA4,	0x03,	0xB7,
		0xE9,	0x02,	0xC3,	0x02,	0xC3,	0x03,	0xE9,	0xA4,
		0x02,	0xC9,	0x03,	0xEC,	0xC9,	0x04,	0xEC,	0xC9,
		0xE2,	0x02,	0xBD,	0x02,	0xC8,	0x02,	0xA8,	0x02,
		0xB5,	0x02,	0xB7,	0x02,	0xB9,	0x02,	0xBB,	0x03,
		0xBB,	0xE8,	0x03,	0xBB,	0xEB,	0x03,	0xBB,	0xEC,
		0x03,	0xBB,	0xED,	0x02,	0xAE,	0x03,	0xAE,	0xE8,
		0x03,	0xAE,	0xEB,	0x03,	0xAE,	0xEC,	0x03,	0xAE,
		0xED,	0x02,	0xA6,	0x03,	0xA6,	0xC0,	0x04,	0xA6,
		0xC0,	0xC3,	0x04,	0xA6,	0xC0,	0xED,	0x03,	0xA6,
		0xC7,	0x04,	0xA6,	0xC7,	0xB7,	0x05,	0xA6,	0xC7,
		0xB7,	0xE7,	0x04,	0xA6,	0xC7,	0xB9,	0x03,	0xA6,
		0xCA,	0x04,	0xA6,	0xCA,	0xE9,	0x03,	0xA6,	0xCB,
		0x03,	0xAB,	0xC3,	0x03,	0xAB,	0xED,	0x03,	0xB1,
		0xEC,	0x02,	0xE1,	0x02,	0xC3,	0x02,	0xC3,	0x02,
		0xDD,	0x03,	0xDD,	0xA4,	0x04,	0xDD,	0xAB,	0xC3,
		0x04,	0xDD,	0xAB,	0xED,	0x03,	0xDD,	0xAF,	0x04,
		0xDD,	0xB1,	0xEC,	0x02,	0xC4,	0x02,	0xE2,	0x03,
		0xB7,	0xE7,	0x03,	0xB3,	0xED,	0x02,	0xA2,	0x03,
		0xAC,	0xE9,	0x03,	0xB5,	0xA4,	0x03,	0xB5,	0xC3,
		0x03,	0xB5,	0xE9,	0x03,	0xB5,	0xEA,	0x03,	0xB5,
		0xEB,	0x03,	0xB5,	0xEC,	0x02,	0xC3,	0x02,	0xC7,
		0x02,	0xCB,	0x02,	0xDF,	0x03,	0xAB,	0xEA,	0x03,
		0xAB,	0xE9,	0x03,	0xB9,	0xEC,	0x03,	0xB7,	0xA4,
		0x04,	0xB7,	0xAB,	0xC3,	0x04,	0xB7,	0xAB,	0xED,
		0x03,	0xB7,	0xAF,	0x04,	0xB7,	0xB1,	0xEC,	0x03,
		0xEC,	0xE8,	0x03,	0xEC,	0xEB,	0x03,	0xEC,	0xEC,
		0x03,	0xEC,	0xED
};

/* 付加される語の文字列の文法表 */
PWORD	pword[] = {
{ 0xa6, 0x05,	2,	0 }, /* あっ	  ある		助動詞	  連用形２	 */
{ 0xa6, 0x01,	4,	0 }, /* あら	  ある		助動詞	  未然形１	 */
{ 0xa6, 0x04,	6,	0 }, /* あり	  ある		助動詞	  連用形１	 */
{ 0xa6, 0x07,	8,	0 }, /* ある	  ある		助動詞	  終止形	 */
{ 0xa6, 0x08,	8,	1 }, /* ある	  ある		助動詞	  連体形	 */
{ 0xa6, 0x09,  10,	0 }, /* あれ	  ある		助動詞	  仮定形	 */
{ 0xa6, 0x0a,  10,	1 }, /* あれ	  ある		助動詞	  命令形１	 */
{ 0xa6, 0x02,  12,	0 }, /* あろ	  ある		助動詞	  未然形２	 */
{ 0x80, 0x05,	1,	0 }, /* い		  く［カ五	助動詞	  連用形２	 */
{ 0x81, 0x06,	1,	1 }, /* い		  ぐ［ガ五	助動詞	  連用形３	 */
{ 0x88, 0x04,	1,	1 }, /* い		  う［ワ五	助動詞	  連用形１	 */
{ 0x8d, 0x07,	1,	1 }, /* い		  い［形容	助動詞	  終止形	 */
{ 0x8d, 0x08,	1,	1 }, /* い		  い［形容	助動詞	  連体形	 */
{ 0xa7, 0x01,	1,	1 }, /* い		  いる		助動詞	  未然形１	 */
{ 0xa7, 0x04,	1,	1 }, /* い		  いる		助動詞	  連用形１	 */
{ 0xaa, 0x01,  14,	1 }, /* いか	  いく		助動詞	  未然形１	 */
{ 0xaa, 0x04,  16,	2 }, /* いき	  いく		助動詞	  連用形１	 */
{ 0xaa, 0x07,  18,	3 }, /* いく	  いく		助動詞	  終止形	 */
{ 0xaa, 0x08,  18,	1 }, /* いく	  いく		助動詞	  連体形	 */
{ 0xaa, 0x09,  20,	5 }, /* いけ	  いく		助動詞	  仮定形	 */
{ 0xaa, 0x0a,  20,	1 }, /* いけ	  いく		助動詞	  命令形１	 */
{ 0xaa, 0x02,  22,	7 }, /* いこ	  いく		助動詞	  未然形２	 */
{ 0xaa, 0x05,  24,	8 }, /* いっ	  いく		助動詞	  連用形２	 */
{ 0xa7, 0x0b,  26,	9 }, /* いよ	  いる		助動詞	  命令形２	 */
{ 0xa7, 0x07,	8, 10 }, /* いる	  いる		助動詞	  終止形	 */
{ 0xa7, 0x08,	8,	1 }, /* いる	  いる		助動詞	  連体形	 */
{ 0xa7, 0x09,  10, 12 }, /* いれ	  いる		助動詞	  仮定形	 */
{ 0xa7, 0x0a,  12, 13 }, /* いろ	  いる		助動詞	  命令形１	 */
{ 0x88, 0x07,	1,	0 }, /* う		  う［ワ五	助動詞	  終止形	 */
{ 0x88, 0x08,	1,	1 }, /* う		  う［ワ五	助動詞	  連体形	 */
{ 0x8f, 0x07,	1,	1 }, /* う		  う		助動詞	  終止形	 */
{ 0x8f, 0x08,	1,	1 }, /* う		  う		助動詞	  連体形	 */
{ 0x88, 0x09,	1,	0 }, /* え		  う［ワ五	助動詞	  仮定形	 */
{ 0x88, 0x0a,	1,	1 }, /* え		  う［ワ五	助動詞	  命令形１	 */
{ 0x88, 0x02,	1,	0 }, /* お		  う［ワ五	助動詞	  未然形２	 */
{ 0xa9, 0x05,  28,	1 }, /* おい	  おく		助動詞	  連用形２	 */
{ 0xa9, 0x01,  14,	2 }, /* おか	  おく		助動詞	  未然形１	 */
{ 0xa9, 0x04,  16,	3 }, /* おき	  おく		助動詞	  連用形１	 */
{ 0xa9, 0x07,  18,	4 }, /* おく	  おく		助動詞	  終止形	 */
{ 0xa9, 0x08,  18,	1 }, /* おく	  おく		助動詞	  連体形	 */
{ 0xa9, 0x09,  20,	6 }, /* おけ	  おく		助動詞	  仮定形	 */
{ 0xa9, 0x0a,  20,	1 }, /* おけ	  おく		助動詞	  命令形１	 */
{ 0xa9, 0x02,  22,	8 }, /* おこ	  おく		助動詞	  未然形２	 */
{ 0x80, 0x01,	1,	0 }, /* か		  く［カ五	助動詞	  未然形１	 */
{ 0xe9, 0x00,	1,	1 }, /* か		  か［副・	助詞				 */
{ 0xea, 0x00,  30,	1 }, /* かしら	  かしら［	助詞				 */
{ 0x8d, 0x04,  33,	2 }, /* かっ	  い［形容	助動詞	  連用形１	 */
{ 0xc0, 0x00,	4,	3 }, /* から	  から［格	助詞				 */
{ 0x8d, 0x01,  12,	4 }, /* かろ	  い［形容	助動詞	  未然形１	 */
{ 0x81, 0x01,	1,	0 }, /* が		  ぐ［ガ五	助動詞	  未然形１	 */
{ 0xc1, 0x00,	1,	1 }, /* が		  が［格・	助詞				 */
{ 0xac, 0x05,  35,	1 }, /* がっ	  がる		助動詞	  連用形２	 */
{ 0xac, 0x01,	4,	2 }, /* がら	  がる		助動詞	  未然形１	 */
{ 0xac, 0x04,	6,	3 }, /* がり	  がる		助動詞	  連用形１	 */
{ 0xac, 0x07,	8,	4 }, /* がる	  がる		助動詞	  終止形	 */
{ 0xac, 0x08,	8,	1 }, /* がる	  がる		助動詞	  連体形	 */
{ 0xac, 0x09,  10,	6 }, /* がれ	  がる		助動詞	  仮定形	 */
{ 0xac, 0x0a,  10,	1 }, /* がれ	  がる		助動詞	  命令形１	 */
{ 0xac, 0x02,  12,	8 }, /* がろ	  がる		助動詞	  未然形２	 */
{ 0x80, 0x04,	1,	0 }, /* き		  く［カ五	助動詞	  連用形１	 */
{ 0x8b, 0x04,	1,	1 }, /* き		  くる		助動詞	  連用形１	 */
{ 0xfa, 0x00,	1,	1 }, /* き		  き［＋形	助詞				 */
{ 0x81, 0x04,	1,	0 }, /* ぎ		  ぐ［ガ五	助動詞	  連用形１	 */
{ 0x80, 0x07,	1,	0 }, /* く		  く［カ五	助動詞	  終止形	 */
{ 0x80, 0x08,	1,	1 }, /* く		  く［カ五	助動詞	  連体形	 */
{ 0x8d, 0x05,	1,	1 }, /* く		  い［形容	助動詞	  連用形２	 */
{ 0x8b, 0x07,	8,	1 }, /* くる	  くる		助動詞	  終止形	 */
{ 0x8b, 0x08,	8,	1 }, /* くる	  くる		助動詞	  連体形	 */
{ 0x8b, 0x09,  10,	3 }, /* くれ	  くる		助動詞	  仮定形	 */
{ 0x81, 0x07,	1,	0 }, /* ぐ		  ぐ［ガ五	助動詞	  終止形	 */
{ 0x81, 0x08,	1,	1 }, /* ぐ		  ぐ［ガ五	助動詞	  連体形	 */
{ 0xda, 0x00,  37,	1 }, /* ぐらい	  ぐらい［	助詞				 */
{ 0x80, 0x09,	1,	0 }, /* け		  く［カ五	助動詞	  仮定形	 */
{ 0x80, 0x0a,	1,	1 }, /* け		  く［カ五	助動詞	  命令形１	 */
{ 0xcc, 0x00,  40,	1 }, /* けど	  けど［接	助詞				 */
{ 0x8d, 0x09,  10,	2 }, /* けれ	  い［形容	助動詞	  仮定形	 */
{ 0xca, 0x00,  42,	1 }, /* けれど	  けれど［	助詞				 */
{ 0xcb, 0x00,  45,	1 }, /* けれども  けれども	助詞				 */
{ 0x81, 0x09,	1,	0 }, /* げ		  ぐ［ガ五	助動詞	  仮定形	 */
{ 0x81, 0x0a,	1,	1 }, /* げ		  ぐ［ガ五	助動詞	  命令形１	 */
{ 0xf7, 0x00,	1,	1 }, /* げ		  げ［＋形	助詞				 */
{ 0x80, 0x02,	1,	0 }, /* こ		  く［カ五	助動詞	  未然形２	 */
{ 0x8b, 0x01,	1,	1 }, /* こ		  くる		助動詞	  未然形１	 */
{ 0x8b, 0x0a,  28,	1 }, /* こい	  くる		助動詞	  命令形１	 */
{ 0xdb, 0x00,  49,	2 }, /* こそ	  こそ［副	助詞				 */
{ 0xf5, 0x00,  51,	3 }, /* こと	  こと［補	助詞				 */
{ 0x81, 0x02,	1,	0 }, /* ご		  ぐ［ガ五	助動詞	  未然形２	 */
{ 0x82, 0x01,	1,	0 }, /* さ		  す［サ五	助動詞	  未然形１	 */
{ 0x89, 0x03,	1,	1 }, /* さ		  する		助動詞	  未然形３	 */
{ 0xeb, 0x00,	1,	1 }, /* さ		  さ［終］	助詞				 */
{ 0xfb, 0x00,	1,	1 }, /* さ		  さ［＋形	助詞				 */
{ 0xdc, 0x00,  53,	1 }, /* さえ	  さえ［副	助詞				 */
{ 0xb2, 0x01,  55,	2 }, /* ささ	  さす		助動詞	  未然形１	 */
{ 0xb2, 0x04,  57,	3 }, /* さし	  さす		助動詞	  連用形１	 */
{ 0xb2, 0x05,  57,	1 }, /* さし	  さす		助動詞	  連用形２	 */
{ 0xb2, 0x07,  59,	5 }, /* さす	  さす		助動詞	  終止形	 */
{ 0xb2, 0x08,  59,	1 }, /* さす	  さす		助動詞	  連体形	 */
{ 0x90, 0x01,  61,	7 }, /* させ	  させる	助動詞	  未然形１	 */
{ 0x90, 0x04,  61,	1 }, /* させ	  させる	助動詞	  連用形１	 */
{ 0xb2, 0x09,  61,	1 }, /* させ	  さす		助動詞	  仮定形	 */
{ 0xb2, 0x0a,  61,	1 }, /* させ	  さす		助動詞	  命令形１	 */
{ 0x90, 0x0b,  63,	1 }, /* させよ	  させる	助動詞	  命令形２	 */
{ 0x90, 0x07,  66,	2 }, /* させる	  させる	助動詞	  終止形	 */
{ 0x90, 0x08,  66,	1 }, /* させる	  させる	助動詞	  連体形	 */
{ 0x90, 0x09,  69,	4 }, /* させれ	  させる	助動詞	  仮定形	 */
{ 0x90, 0x0a,  72,	5 }, /* させろ	  させる	助動詞	  命令形１	 */
{ 0xb2, 0x02,  49, 16 }, /* さそ	  さす		助動詞	  未然形２	 */
{ 0x8a, 0x03,	1,	0 }, /* ざ		  ずる		助動詞	  未然形３	 */
{ 0x82, 0x04,	1,	0 }, /* し		  す［サ五	助動詞	  連用形１	 */
{ 0x82, 0x05,	1,	1 }, /* し		  す［サ五	助動詞	  連用形２	 */
{ 0x89, 0x01,	1,	1 }, /* し		  する		助動詞	  未然形１	 */
{ 0x89, 0x04,	1,	1 }, /* し		  する		助動詞	  連用形１	 */
{ 0xcd, 0x00,	1,	1 }, /* し		  し［接］	助詞				 */
{ 0xdd, 0x00,  14,	1 }, /* しか	  しか［副	助詞				 */
{ 0x89, 0x0a,  12,	2 }, /* しろ	  する		助動詞	  命令形１	 */
{ 0x8a, 0x01,	1,	0 }, /* じ		  ずる		助動詞	  未然形１	 */
{ 0x8a, 0x04,	1,	1 }, /* じ		  ずる		助動詞	  連用形１	 */
{ 0x8a, 0x0a,  12,	1 }, /* じろ	  ずる		助動詞	  命令形１	 */
{ 0x82, 0x07,	1,	0 }, /* す		  す［サ五	助動詞	  終止形	 */
{ 0x82, 0x08,	1,	1 }, /* す		  す［サ五	助動詞	  連体形	 */
{ 0x89, 0x06,	1,	1 }, /* す		  する		助動詞	  連用形３	 */
{ 0xab, 0x01,  75,	1 }, /* すぎ	  すぎる	助動詞	  未然形１	 */
{ 0xab, 0x04,  75,	1 }, /* すぎ	  すぎる	助動詞	  連用形１	 */
{ 0xab, 0x0a,  77,	1 }, /* すぎよ	  すぎる	助動詞	  命令形１	 */
{ 0xab, 0x07,  80,	2 }, /* すぎる	  すぎる	助動詞	  終止形	 */
{ 0xab, 0x08,  80,	1 }, /* すぎる	  すぎる	助動詞	  連体形	 */
{ 0xab, 0x09,  83,	4 }, /* すぎれ	  すぎる	助動詞	  仮定形	 */
{ 0xab, 0x0b,  86,	5 }, /* すぎろ	  すぎる	助動詞	  命令形２	 */
{ 0xe7, 0x00,	4,	8 }, /* すら	  すら［副	助詞				 */
{ 0x89, 0x07,	8,	9 }, /* する	  する		助動詞	  終止形	 */
{ 0x89, 0x08,	8,	1 }, /* する	  する		助動詞	  連体形	 */
{ 0x89, 0x09,  10, 11 }, /* すれ	  する		助動詞	  仮定形	 */
{ 0x8a, 0x06,	1,	0 }, /* ず		  ずる		助動詞	  連用形３	 */
{ 0x9c, 0x04,	1,	1 }, /* ず		  ぬ		助動詞	  連用形１	 */
{ 0x8a, 0x07,	8,	1 }, /* ずる	  ずる		助動詞	  終止形	 */
{ 0x8a, 0x08,	8,	1 }, /* ずる	  ずる		助動詞	  連体形	 */
{ 0x8a, 0x09,  10,	3 }, /* ずれ	  ずる		助動詞	  仮定形	 */
{ 0x82, 0x09,	1,	0 }, /* せ		  す［サ五	助動詞	  仮定形	 */
{ 0x82, 0x0a,	1,	1 }, /* せ		  す［サ五	助動詞	  命令形１	 */
{ 0x89, 0x02,	1,	1 }, /* せ		  する		助動詞	  未然形２	 */
{ 0x91, 0x01,	1,	1 }, /* せ		  せる		助動詞	  未然形１	 */
{ 0x91, 0x04,	1,	1 }, /* せ		  せる		助動詞	  連用形１	 */
{ 0x89, 0x0b,  26,	1 }, /* せよ	  する		助動詞	  命令形２	 */
{ 0x91, 0x0b,  26,	1 }, /* せよ	  せる		助動詞	  命令形２	 */
{ 0x91, 0x07,	8,	3 }, /* せる	  せる		助動詞	  終止形	 */
{ 0x91, 0x08,	8,	1 }, /* せる	  せる		助動詞	  連体形	 */
{ 0x91, 0x09,  10,	5 }, /* せれ	  せる		助動詞	  仮定形	 */
{ 0x91, 0x0a,  12,	6 }, /* せろ	  せる		助動詞	  命令形１	 */
{ 0x8a, 0x02,	1,	0 }, /* ぜ		  ずる		助動詞	  未然形２	 */
{ 0xec, 0x00,	1,	1 }, /* ぜ		  ぜ［終］	助詞				 */
{ 0x8a, 0x0b,  26,	1 }, /* ぜよ	  ずる		助動詞	  命令形２	 */
{ 0x82, 0x02,	1,	0 }, /* そ		  す［サ五	助動詞	  未然形２	 */
{ 0x92, 0x0a,  89,	1 }, /* そう	  そうだ	助動詞	  命令形１	 */
{ 0x92, 0x07,  91,	1 }, /* そうだ	  そうだ	助動詞	  終止形	 */
{ 0x92, 0x04,  94,	1 }, /* そうだっ  そうだ	助動詞	  連用形１	 */
{ 0x92, 0x01,  98,	2 }, /* そうだろ  そうだ	助動詞	  未然形１	 */
{ 0x92, 0x05, 102,	4 }, /* そうで	  そうだ	助動詞	  連用形２	 */
{ 0x93, 0x04, 105,	1 }, /* そうでし  そうです	助動詞	  連用形１	 */
{ 0x93, 0x01, 109,	1 }, /* そうでしょそうです	助動詞	  未然形１	 */
{ 0x93, 0x07, 114,	3 }, /* そうです  そうです	助動詞	  終止形	 */
{ 0x93, 0x08, 114,	1 }, /* そうです  そうです	助動詞	  連体形	 */
{ 0x92, 0x08, 118,	9 }, /* そうな	  そうだ	助動詞	  連体形	 */
{ 0x92, 0x09, 121,	1 }, /* そうなら  そうだ	助動詞	  仮定形	 */
{ 0x92, 0x06, 125, 11 }, /* そうに	  そうだ	助動詞	  連用形３	 */
{ 0xed, 0x00,	1,	0 }, /* ぞ		  ぞ［終］	助詞				 */
{ 0x83, 0x01,	1,	0 }, /* た		  つ［タ五	助動詞	  未然形１	 */
{ 0x94, 0x07,	1,	1 }, /* た		  た		助動詞	  終止形	 */
{ 0x94, 0x08,	1,	1 }, /* た		  た		助動詞	  連体形	 */
{ 0x96, 0x03,	1,	1 }, /* た		  たい		助動詞	  未然形３	 */
{ 0x96, 0x07,  28,	1 }, /* たい	  たい		助動詞	  終止形	 */
{ 0x96, 0x08,  28,	1 }, /* たい	  たい		助動詞	  連体形	 */
{ 0x96, 0x04, 128,	3 }, /* たかっ	  たい		助動詞	  連用形１	 */
{ 0x96, 0x01, 131,	4 }, /* たかろ	  たい		助動詞	  未然形１	 */
{ 0x96, 0x05,  18,	5 }, /* たく	  たい		助動詞	  連用形２	 */
{ 0x96, 0x09, 134,	6 }, /* たけれ	  たい		助動詞	  仮定形	 */
{ 0xf6, 0x00, 137,	7 }, /* ため	  ため［補	助詞				 */
{ 0x94, 0x09,	4,	8 }, /* たら	  た		助動詞	  仮定形	 */
{ 0xce, 0x00,	6,	9 }, /* たり	  たり［接	助詞				 */
{ 0xaf, 0x08,	8, 10 }, /* たる	  たる		助動詞	  連体形	 */
{ 0xaf, 0x09,  10, 11 }, /* たれ	  たる		助動詞	  仮定形	 */
{ 0xaf, 0x0a,  10,	1 }, /* たれ	  たる		助動詞	  命令形１	 */
{ 0x94, 0x01,  12, 13 }, /* たろ	  た		助動詞	  未然形１	 */
{ 0x8e, 0x07,	1,	0 }, /* だ		  だ［形動	助動詞	  終止形	 */
{ 0x95, 0x07,	1,	1 }, /* だ		  だ		助動詞	  終止形	 */
{ 0x95, 0x08,	1,	1 }, /* だ		  だ		助動詞	  連体形	 */
{ 0x97, 0x07,	1,	1 }, /* だ		  だ		助動詞	  終止形	 */
{ 0xde, 0x00,  20,	1 }, /* だけ	  だけ［副	助詞				 */
{ 0x8e, 0x04, 139,	2 }, /* だっ	  だ［形動	助動詞	  連用形１	 */
{ 0x97, 0x04, 141,	1 }, /* だっ	  だ		助動詞	  連用形１	 */
{ 0x95, 0x09,	4,	4 }, /* だら	  だ		助動詞	  仮定形	 */
{ 0xcf, 0x00,	6,	5 }, /* だり	  だり［接	助詞				 */
{ 0x8e, 0x01,  12,	6 }, /* だろ	  だ［形動	助動詞	  未然形１	 */
{ 0x95, 0x01,  12,	1 }, /* だろ	  だ		助動詞	  未然形１	 */
{ 0x98, 0x01,  12,	1 }, /* だろ	  （だろ）	助動詞	  未然形１	 */
{ 0x83, 0x04,	1,	0 }, /* ち		  つ［タ五	助動詞	  連用形１	 */
{ 0x83, 0x05,	1,	0 }, /* っ		  つ［タ五	助動詞	  連用形２	 */
{ 0x87, 0x05,	1,	1 }, /* っ		  る［ラ五	助動詞	  連用形２	 */
{ 0x88, 0x05,	1,	1 }, /* っ		  う［ワ五	助動詞	  連用形２	 */
{ 0xb1, 0x03, 143,	1 }, /* っぽ	  っぽい	助動詞	  未然形３	 */
{ 0xb1, 0x07, 145,	1 }, /* っぽい	  っぽい	助動詞	  終止形	 */
{ 0xb1, 0x08, 145,	1 }, /* っぽい	  っぽい	助動詞	  連体形	 */
{ 0xb1, 0x04, 148,	3 }, /* っぽかっ  っぽい	助動詞	  連用形１	 */
{ 0xb1, 0x01, 152,	4 }, /* っぽかろ  っぽい	助動詞	  未然形１	 */
{ 0xb1, 0x05, 156,	5 }, /* っぽく	  っぽい	助動詞	  連用形２	 */
{ 0xb1, 0x09, 159,	6 }, /* っぽけれ  っぽい	助動詞	  仮定形	 */
{ 0x83, 0x07,	1,	0 }, /* つ		  つ［タ五	助動詞	  終止形	 */
{ 0x83, 0x08,	1,	1 }, /* つ		  つ［タ五	助動詞	  連体形	 */
{ 0xd5, 0x00, 163,	1 }, /* つつ	  つつ［接	助詞				 */
{ 0x83, 0x09,	1,	0 }, /* て		  つ［タ五	助動詞	  仮定形	 */
{ 0x83, 0x0a,	1,	1 }, /* て		  つ［タ五	助動詞	  命令形１	 */
{ 0xd0, 0x00,	1,	1 }, /* て		  て［接］	助詞				 */
{ 0xd2, 0x00, 165,	1 }, /* ても	  ても［接	助詞				 */
{ 0x8e, 0x05,	1,	0 }, /* で		  だ［形動	助動詞	  連用形２	 */
{ 0x97, 0x05,	1,	1 }, /* で		  だ		助動詞	  連用形２	 */
{ 0xc3, 0x00,	1,	1 }, /* で		  で［格」	助詞				 */
{ 0xd1, 0x00,	1,	1 }, /* で		  で［接］	助詞				 */
{ 0x99, 0x04,  57,	1 }, /* でし	  です		助動詞	  連用形１	 */
{ 0x9a, 0x01, 167,	1 }, /* でしょ	  （でしょ	助動詞	  未然形１	 */
{ 0x99, 0x07,  59,	3 }, /* です	  です		助動詞	  終止形	 */
{ 0x99, 0x08,  59,	1 }, /* です	  です		助動詞	  連体形	 */
{ 0xd3, 0x00, 165,	5 }, /* でも	  でも［接	助詞				 */
{ 0x83, 0x02,	1,	0 }, /* と		  つ［タ五	助動詞	  未然形２	 */
{ 0xaf, 0x04,	1,	1 }, /* と		  たる		助動詞	  連用形１	 */
{ 0xc2, 0x00,	1,	1 }, /* と		  と［格・	助詞				 */
{ 0xfc, 0x00,	1,	1 }, /* と		  と［＋副	助詞				 */
{ 0xd9, 0x00, 170,	1 }, /* ところ	  ところ［	助詞				 */
{ 0xee, 0x00, 165,	2 }, /* とも	  とも［終	助詞				 */
{ 0x84, 0x01,	1,	0 }, /* な		  ぬ［ナ五	助動詞	  未然形１	 */
{ 0x8e, 0x08,	1,	1 }, /* な		  だ［形動	助動詞	  連体形	 */
{ 0x97, 0x08,	1,	1 }, /* な		  だ		助動詞	  連体形	 */
{ 0x9b, 0x03,	1,	1 }, /* な		  ない		助動詞	  未然形３	 */
{ 0xef, 0x00,	1,	1 }, /* な		  な［終］	助詞				 */
{ 0xf0, 0x00, 173,	1 }, /* なあ	  なあ［終	助詞				 */
{ 0x9b, 0x07,  28,	2 }, /* ない	  ない		助動詞	  終止形	 */
{ 0x9b, 0x08,  28,	1 }, /* ない	  ない		助動詞	  連体形	 */
{ 0x9b, 0x04, 128,	4 }, /* なかっ	  ない		助動詞	  連用形１	 */
{ 0x9b, 0x01, 131,	5 }, /* なかろ	  ない		助動詞	  未然形１	 */
{ 0xd4, 0x00, 175,	6 }, /* ながら	  ながら［	助詞				 */
{ 0x9b, 0x05,  18,	7 }, /* なく	  ない		助動詞	  連用形２	 */
{ 0x9b, 0x09, 134,	8 }, /* なけれ	  ない		助動詞	  仮定形	 */
{ 0x9b, 0x06,  55,	9 }, /* なさ	  ない		助動詞	  連用形３	 */
{ 0xad, 0x0b, 178,	1 }, /* なさい	  なさる	助動詞	  命令形２	 */
{ 0xad, 0x05, 181,	2 }, /* なさっ	  なさる	助動詞	  連用形２	 */
{ 0xad, 0x01, 184,	3 }, /* なさら	  なさる	助動詞	  未然形１	 */
{ 0xad, 0x04, 187,	4 }, /* なさり	  なさる	助動詞	  連用形１	 */
{ 0xad, 0x07, 190,	5 }, /* なさる	  なさる	助動詞	  終止形	 */
{ 0xad, 0x08, 190,	1 }, /* なさる	  なさる	助動詞	  連体形	 */
{ 0xad, 0x09, 193,	7 }, /* なされ	  なさる	助動詞	  仮定形	 */
{ 0xad, 0x0a, 193,	1 }, /* なされ	  なさる	助動詞	  命令形１	 */
{ 0xb0, 0x05, 196, 18 }, /* なっ	  なる		助動詞	  連用形２	 */
{ 0xdf, 0x00,  40, 19 }, /* など	  など［副	助詞				 */
{ 0x8e, 0x09,	4, 20 }, /* なら	  だ［形動	助動詞	  仮定形	 */
{ 0x98, 0x09,	4,	1 }, /* なら	  （だろ）	助動詞	  仮定形	 */
{ 0xb0, 0x01,	4,	1 }, /* なら	  なる		助動詞	  未然形１	 */
{ 0xb0, 0x04,	6, 23 }, /* なり	  なる		助動詞	  連用形１	 */
{ 0xe0, 0x00,	6,	1 }, /* なり	  なり［副	助詞				 */
{ 0xb0, 0x07,	8, 25 }, /* なる	  なる		助動詞	  終止形	 */
{ 0xb0, 0x08,	8,	1 }, /* なる	  なる		助動詞	  連体形	 */
{ 0xb0, 0x09,  10, 27 }, /* なれ	  なる		助動詞	  仮定形	 */
{ 0xb0, 0x0a,  10,	1 }, /* なれ	  なる		助動詞	  命令形１	 */
{ 0xb0, 0x02,  12, 29 }, /* なろ	  なる		助動詞	  未然形２	 */
{ 0x84, 0x04,	1,	0 }, /* に		  ぬ［ナ五	助動詞	  連用形１	 */
{ 0x8e, 0x06,	1,	1 }, /* に		  だ［形動	助動詞	  連用形３	 */
{ 0xc4, 0x00,	1,	1 }, /* に		  に［格・	助詞				 */
{ 0xfd, 0x00,	1,	1 }, /* に		  に［＋副	助詞				 */
{ 0x84, 0x07,	1,	0 }, /* ぬ		  ぬ［ナ五	助動詞	  終止形	 */
{ 0x84, 0x08,	1,	1 }, /* ぬ		  ぬ［ナ五	助動詞	  連体形	 */
{ 0x9c, 0x07,	1,	1 }, /* ぬ		  ぬ		助動詞	  終止形	 */
{ 0x9c, 0x08,	1,	1 }, /* ぬ		  ぬ		助動詞	  連体形	 */
{ 0x84, 0x09,	1,	0 }, /* ね		  ぬ［ナ五	助動詞	  仮定形	 */
{ 0x84, 0x0a,	1,	1 }, /* ね		  ぬ［ナ五	助動詞	  命令形１	 */
{ 0x9c, 0x09,	1,	1 }, /* ね		  ぬ		助動詞	  仮定形	 */
{ 0xf1, 0x00,	1,	1 }, /* ね		  ね［終］	助詞				 */
{ 0xf2, 0x00,  53,	1 }, /* ねえ	  ねえ［終	助詞				 */
{ 0x84, 0x02,	1,	0 }, /* の		  ぬ［ナ五	助動詞	  未然形２	 */
{ 0xc8, 0x00,	1,	1 }, /* の		  の［格・	助詞				 */
{ 0xfe, 0x00,	1,	1 }, /* の		  の［＋副	助詞				 */
{ 0xd6, 0x00, 198,	1 }, /* ので	  ので［接	助詞				 */
{ 0xd7, 0x00, 200,	2 }, /* のに	  のに［接	助詞				 */
{ 0xe8, 0x00, 202,	3 }, /* のみ	  のみ［副	助詞				 */
{ 0xe1, 0x00,	1,	0 }, /* は		  は［副］	助詞				 */
{ 0x85, 0x01,	1,	0 }, /* ば		  ぶ［バ五	助動詞	  未然形１	 */
{ 0xd8, 0x00,	1,	1 }, /* ば		  ば［接］	助詞				 */
{ 0xe2, 0x00, 204,	1 }, /* ばかり	  ばかり［	助詞				 */
{ 0x85, 0x04,	1,	0 }, /* び		  ぶ［バ五	助動詞	  連用形１	 */
{ 0x85, 0x07,	1,	0 }, /* ぶ		  ぶ［バ五	助動詞	  終止形	 */
{ 0x85, 0x08,	1,	1 }, /* ぶ		  ぶ［バ五	助動詞	  連体形	 */
{ 0xc5, 0x00,	1,	0 }, /* へ		  へ［格］	助詞				 */
{ 0x85, 0x09,	1,	0 }, /* べ		  ぶ［バ五	助動詞	  仮定形	 */
{ 0x85, 0x0a,	1,	1 }, /* べ		  ぶ［バ五	助動詞	  命令形１	 */
{ 0xae, 0x01, 207,	1 }, /* べから	  べし		助動詞	  未然形１	 */
{ 0xae, 0x08,  16,	2 }, /* べき	  べし		助動詞	  連体形	 */
{ 0xae, 0x04,  18,	3 }, /* べく	  べし		助動詞	  連用形１	 */
{ 0xae, 0x09, 134,	4 }, /* べけれ	  べし		助動詞	  仮定形	 */
{ 0xae, 0x07,  57,	5 }, /* べし	  べし		助動詞	  終止形	 */
{ 0xe3, 0x00,  40,	0 }, /* ほど	  ほど［副	助詞				 */
{ 0x85, 0x02,	1,	0 }, /* ぼ		  ぶ［バ五	助動詞	  未然形２	 */
{ 0x86, 0x01,	1,	0 }, /* ま		  む［マ五	助動詞	  未然形１	 */
{ 0x9d, 0x07,  28,	1 }, /* まい	  まい		助動詞	  終止形	 */
{ 0x9d, 0x08,  28,	1 }, /* まい	  まい		助動詞	  連体形	 */
{ 0x9e, 0x04,  57,	3 }, /* まし	  ます		助動詞	  連用形１	 */
{ 0x9e, 0x0b,  57,	1 }, /* まし	  ます		助動詞	  命令形２	 */
{ 0x9e, 0x02, 167,	1 }, /* ましょ	  ます		助動詞	  未然形２	 */
{ 0x9e, 0x07,  59,	6 }, /* ます	  ます		助動詞	  終止形	 */
{ 0x9e, 0x08,  59,	1 }, /* ます	  ます		助動詞	  連体形	 */
{ 0x9e, 0x09, 210,	1 }, /* ますれ	  ます		助動詞	  仮定形	 */
{ 0x9e, 0x01,  61,	9 }, /* ませ	  ます		助動詞	  未然形１	 */
{ 0x9e, 0x0a,  61,	1 }, /* ませ	  ます		助動詞	  命令形１	 */
{ 0xe4, 0x00, 198, 11 }, /* まで	  まで［副	助詞				 */
{ 0x86, 0x04,	1,	0 }, /* み		  む［マ五	助動詞	  連用形１	 */
{ 0xa8, 0x01,	1,	1 }, /* み		  みる		助動詞	  未然形１	 */
{ 0xa8, 0x04,	1,	1 }, /* み		  みる		助動詞	  連用形１	 */
{ 0xf8, 0x00,	1,	1 }, /* み		  み［＋形	助詞				 */
{ 0xa8, 0x0b,  26,	1 }, /* みよ	  みる		助動詞	  命令形２	 */
{ 0xa8, 0x07,	8,	2 }, /* みる	  みる		助動詞	  終止形	 */
{ 0xa8, 0x08,	8,	1 }, /* みる	  みる		助動詞	  連体形	 */
{ 0xa8, 0x09,  10,	4 }, /* みれ	  みる		助動詞	  仮定形	 */
{ 0xa8, 0x0a,  12,	5 }, /* みろ	  みる		助動詞	  命令形１	 */
{ 0x86, 0x07,	1,	0 }, /* む		  む［マ五	助動詞	  終止形	 */
{ 0x86, 0x08,	1,	1 }, /* む		  む［マ五	助動詞	  連体形	 */
{ 0x86, 0x09,	1,	0 }, /* め		  む［マ五	助動詞	  仮定形	 */
{ 0x86, 0x0a,	1,	1 }, /* め		  む［マ五	助動詞	  命令形１	 */
{ 0xf9, 0x00,	1,	1 }, /* め		  め［＋形	助詞				 */
{ 0x86, 0x02,	1,	0 }, /* も		  む［マ五	助動詞	  未然形２	 */
{ 0xe5, 0x00,	1,	1 }, /* も		  も［副］	助詞				 */
{ 0xc9, 0x00,	1,	0 }, /* や		  や［格・	助詞				 */
{ 0xe6, 0x00,	4,	1 }, /* やら	  やら［副	助詞				 */
{ 0x8c, 0x0b,	1,	0 }, /* よ		  る［上下	助動詞	  命令形２	 */
{ 0xf3, 0x00,	1,	1 }, /* よ		  よ［終］	助詞				 */
{ 0x9f, 0x07,  89,	1 }, /* よう	  よう		助動詞	  終止形	 */
{ 0x9f, 0x08,  89,	1 }, /* よう	  よう		助動詞	  連体形	 */
{ 0xa0, 0x07,  91,	1 }, /* ようだ	  ようだ	助動詞	  終止形	 */
{ 0xa0, 0x04,  94,	1 }, /* ようだっ  ようだ	助動詞	  連用形１	 */
{ 0xa0, 0x01,  98,	2 }, /* ようだろ  ようだ	助動詞	  未然形１	 */
{ 0xa0, 0x05, 102,	4 }, /* ようで	  ようだ	助動詞	  連用形２	 */
{ 0xa1, 0x04, 105,	1 }, /* ようでし  ようです	助動詞	  連用形１	 */
{ 0xa1, 0x01, 109,	1 }, /* ようでしょようです	助動詞	  未然形１	 */
{ 0xa1, 0x07, 114,	3 }, /* ようです  ようです	助動詞	  終止形	 */
{ 0xa1, 0x08, 114,	1 }, /* ようです  ようです	助動詞	  連体形	 */
{ 0xa0, 0x08, 118,	9 }, /* ような	  ようだ	助動詞	  連体形	 */
{ 0xa0, 0x09, 121,	1 }, /* ようなら  ようだ	助動詞	  仮定形	 */
{ 0xa0, 0x06, 125, 11 }, /* ように	  ようだ	助動詞	  連用形３	 */
{ 0xc6, 0x00,	6, 14 }, /* より	  より［格	助詞				 */
{ 0x87, 0x01,	1,	0 }, /* ら		  る［ラ五	助動詞	  未然形１	 */
{ 0xa2, 0x03,  57,	1 }, /* らし	  らしい	助動詞	  未然形３	 */
{ 0xa2, 0x07, 213,	1 }, /* らしい	  らしい	助動詞	  終止形	 */
{ 0xa2, 0x08, 213,	1 }, /* らしい	  らしい	助動詞	  連体形	 */
{ 0xa2, 0x04, 216,	3 }, /* らしかっ  らしい	助動詞	  連用形１	 */
{ 0xa2, 0x01, 220,	4 }, /* らしかろ  らしい	助動詞	  未然形１	 */
{ 0xa2, 0x05, 224,	5 }, /* らしく	  らしい	助動詞	  連用形２	 */
{ 0xa2, 0x09, 227,	6 }, /* らしけれ  らしい	助動詞	  仮定形	 */
{ 0xa3, 0x01,  10,	8 }, /* られ	  られる	助動詞	  未然形１	 */
{ 0xa3, 0x04,  10,	1 }, /* られ	  られる	助動詞	  連用形１	 */
{ 0xa3, 0x0b, 231,	1 }, /* られよ	  られる	助動詞	  命令形２	 */
{ 0xa3, 0x07, 234,	2 }, /* られる	  られる	助動詞	  終止形	 */
{ 0xa3, 0x08, 234,	1 }, /* られる	  られる	助動詞	  連体形	 */
{ 0xa3, 0x09, 237,	4 }, /* られれ	  られる	助動詞	  仮定形	 */
{ 0xa3, 0x0a, 240,	5 }, /* られろ	  られる	助動詞	  命令形１	 */
{ 0x87, 0x04,	1,	0 }, /* り		  る［ラ五	助動詞	  連用形１	 */
{ 0x87, 0x07,	1,	0 }, /* る		  る［ラ五	助動詞	  終止形	 */
{ 0x87, 0x08,	1,	1 }, /* る		  る［ラ五	助動詞	  連体形	 */
{ 0x8c, 0x07,	1,	1 }, /* る		  る［上下	助動詞	  終止形	 */
{ 0x8c, 0x08,	1,	1 }, /* る		  る［上下	助動詞	  連体形	 */
{ 0x87, 0x09,	1,	0 }, /* れ		  る［ラ五	助動詞	  仮定形	 */
{ 0x87, 0x0a,	1,	1 }, /* れ		  る［ラ五	助動詞	  命令形１	 */
{ 0x8c, 0x09,	1,	1 }, /* れ		  る［上下	助動詞	  仮定形	 */
{ 0xa4, 0x01,	1,	1 }, /* れ		  れる		助動詞	  未然形１	 */
{ 0xa4, 0x04,	1,	1 }, /* れ		  れる		助動詞	  連用形１	 */
{ 0xa4, 0x0b,  26,	1 }, /* れよ	  れる		助動詞	  命令形２	 */
{ 0xa4, 0x07,	8,	2 }, /* れる	  れる		助動詞	  終止形	 */
{ 0xa4, 0x08,	8,	1 }, /* れる	  れる		助動詞	  連体形	 */
{ 0xa4, 0x09,  10,	4 }, /* れれ	  れる		助動詞	  仮定形	 */
{ 0xa4, 0x0a,  12,	5 }, /* れろ	  れる		助動詞	  命令形１	 */
{ 0x87, 0x02,	1,	0 }, /* ろ		  る［ラ五	助動詞	  未然形２	 */
{ 0x8c, 0x0a,	1,	1 }, /* ろ		  る［上下	助動詞	  命令形１	 */
{ 0x88, 0x01,	1,	0 }, /* わ		  う［ワ五	助動詞	  未然形１	 */
{ 0xf4, 0x00,	1,	1 }, /* わ		  わ［終］	助詞				 */
{ 0xc7, 0x00,	1,	0 }, /* を		  を［格］	助詞				 */
{ 0x84, 0x06,	1,	0 }, /* ん		  ぬ［ナ五	助動詞	  連用形３	 */
{ 0x85, 0x06,	1,	1 }, /* ん		  ぶ［バ五	助動詞	  連用形３	 */
{ 0x86, 0x06,	1,	1 }, /* ん		  む［マ五	助動詞	  連用形３	 */
{ 0xa5, 0x07,	1,	1 }, /* ん		  ん		助動詞	  終止形	 */
{ 0xa5, 0x08,	1,	1 }  /* ん		  ん		助動詞	  連体形	 */
};



/* 付加語のコードのアクセス用データ */
short	pwordmap[] = {
		1,		1,		1,		8,		8,		28, 	28, 	32,
		32, 	34, 	34, 	43, 	49, 	59, 	62, 	63,
		69, 	72, 	78, 	81, 	86, 	87, 	107,	108,
		115,	118,	132,	137,	148,	151,	164,	165,
		182,	194,	195,	195,	205,	208,	208,	212,
		221,	227,	227,	261,	265,	269,	274,	280,
		281,	284,	284,	284,	285,	285,	285,	287,
		287,	288,	295,	295,	296,	297,	297,	309,
		318,	320,	323,	325,	325,	327,	327,	327,
		327,	343,	358,	359,	363,	373,	375,	375,
		377,	377,	377,	378,	383,	383,	383,	383,
		383,	383,	383,	383,	383,	383,	383,	383
};
