/*******************************************************************************
* File name : 
* Author :
* description :
*
* Copyright (c) 2006 by Humax Co., Ltd.
* All right reserved
*******************************************************************************/
 
#ifndef _FAI_HDMI_H_
#define _FAI_HDMI_H_

/*******************************************************************************
* headers
*******************************************************************************/


/*******************************************************************************
* Definitions, typdef & const data
*******************************************************************************/
typedef enum
{
	FAI_HDMI_TMD_ERR_DISCONNECT	= 0,
	FAI_HDMI_TMD_ERR_HDCP_FUNCTION, 
	FAI_HDMI_TMD_ERR_HDCP_ENABLE, 
	FAI_HDMI_TMD_ERR_CEC_FUNCTION,
}FAI_HDMI_TMD_ERR;


/*******************************************************************************
* Global variables and structures
*******************************************************************************/


/*******************************************************************************
* External variables and functions
*******************************************************************************/


/*******************************************************************************
* Static variables and structures
*******************************************************************************/


/*******************************************************************************
* Static function prototypes
*******************************************************************************/

/*******************************************************************************
* function : FAI_HDMI_Init
* description :
* input :
* output :
* return : 
* 기타 참고자료 및 파일
*******************************************************************************/
FAI_ERR_CODE FAI_HDMI_Init();

/*******************************************************************************
* function : FAI_HDMI_Output
* description :
* input :
* output :
* return : 
* 기타 참고자료 및 파일
*******************************************************************************/
FAI_ERR_CODE FAI_HDMI_Cec(unsigned short usMsgId,unsigned char ucArgc, unsigned char *pucArgList);

/*******************************************************************************
* function : FAI_HDMI_Output
* description :
* input :
* output :
* return : 
* 기타 참고자료 및 파일
*******************************************************************************/
FAI_ERR_CODE FAI_HDMI_EnableHdcp(unsigned short usMsgId,unsigned char ucArgc, unsigned char *pucArgList);

/*******************************************************************************
* function : FAI_HDMI_HDCPOnOff_UI
* description :
* input :
* output :
* return : 
* 기타 참고자료 및 파일
*******************************************************************************/
FAI_ERR_CODE FAI_HDMI_EnableHDCP_UI(void);

/*******************************************************************************
* function : 
* description : 
* input :
* output :
* return :
* 기타 참고자료 및 파일
*******************************************************************************/
FAI_ERR_CODE FAI_HDMI_CecCtrl_UI(void);

#endif /* _FAI_HDMI_H_ */

/* end of file */

